app/controllers/check_ins_controller.rb

INSERT INTO `check_ins` (`user_id`, `question`, `answer`, `created_at`, `updated_at`) VALUES (1, 'this is just a test', 'Comment', '2018-07-08 15:57:13', '2018-07-08 15:57:13')
---
  def create
    @check_in = current_user.check_ins.new(check_in_params)
    if @check_in.valid?
      @check_in.save